package me.xxxelppa.study.week03;

public class Exam_009 {
    public static void main(String[] args) {
        int v1, v2;
        
        System.out.println("============= << 연산 ============");
        v1 = 17;            // 00000000 00000000 00000000 00010001
        v2 = v1 << 3;       // 00000000 00000000 00000000 10001000
        System.out.println(v2); // 128 + 8 = 136
        System.out.println();
    
        System.out.println("========== 양수 >> 연산 ==========");
        v1 = 17;            // 00000000 00000000 00000000 00010001
        v2 = v1 >> 3;       // 00000000 00000000 00000000 00000010
        System.out.println(v2); // 2
        System.out.println();
    
        System.out.println("========== 음수 >> 연산 ==========");
        v1 = -17;           // 11111111 11111111 11111111 11101111
        v2 = v1 >> 3;       // 11111111 11111111 11111111 11111101
        System.out.println(v2); // -3
        System.out.println();
    
        System.out.println("========== 양수 >>> 연산 ==========");
        v1 = 17;            // 00000000 00000000 00000000 00010001
        v2 = v1 >>> 3;      // 00000000 00000000 00000000 00000010
        System.out.println(v2); // 2
        System.out.println();
    
        System.out.println("========== 음수 >>> 연산 ==========");
        v1 = -17;               // 11111111 11111111 11111111 11101111
        v2 = v1 >>> 3;          // 00011111 11111111 11111111 11111101
        System.out.println(v2); // 00100000 00000000 00000000 00000000 -> 536870912 :: 이 값에서 1을 빼면
                                // 00011111 11111111 11111111 11111111 -> 536870911 :: 이 값에서 2를 빼면
                                // 00011111 11111111 11111111 11111101 -> 536870909
        System.out.println();
    }
}
